In [15]:
import pandas as pd
import pyodbc
import sqlite3

# iedereen heeft andere servername btw

In [16]:
servername = 'SIU1\\SQLEXPRESS'

# Northwind connectie

In [17]:
northwind_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=NorthWind; Trusted_Connection=yes')
nwCursor = northwind_conn.cursor()
nwCursor

# Adventureworks connectie

In [18]:
adventureworks_conn = pyodbc.connect('DRIVER={SQL SERVER};SERVER='+servername+';DATABASE=AdventureWorks2019; Trusted_Connection=yes')
awCursor = adventureworks_conn.cursor()
awCursor

# Aenc connectie

In [19]:
aenc_conn = pyodbc.connect('DRIVER={Microsoft Access Driver (*.mdb, *.accdb)};DBQ=../raw-databases/aenc.accdb;')
aencCursor = aenc_conn.cursor()

table_names = [table_info.table_name for table_info in aencCursor.tables()]

# Print table names
print(table_names)

['MSysAccessStorage', 'MSysACEs', 'MSysComplexColumns', 'MSysIMEXColumns', 'MSysIMEXSpecs', 'MSysNameMap', 'MSysNavPaneGroupCategories', 'MSysNavPaneGroups', 'MSysNavPaneGroupToObjects', 'MSysNavPaneObjectIDs', 'MSysObjects', 'MSysQueries', 'MSysRelationships', 'MSysResources', 'bonus', 'customer', 'department', 'employee', 'product', 'region', 'sales_order', 'sales_order_item', 'state']

In [20]:
aenctest = pd.read_sql_query('SELECT * FROM customer', aenc_conn)
awtest = pd.read_sql_query('SELECT * FROM Person.Address', adventureworks_conn)
nwtest = pd.read_sql_query('SELECT * FROM customers', northwind_conn)

# print(aenctest)
# print(awtest)
# print(nwtest)

C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\825424140.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenctest = pd.read_sql_query('SELECT * FROM customer', aenc_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\825424140.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest = pd.read_sql_query('SELECT * FROM Person.Address', adventureworks_conn)
C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\825424140.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nwtest = pd.read_sql_query('SELECT * FROM customers', northwind_conn)

# Dataframe maken

AenC

In [21]:
aenctest = pd.read_sql_query('SELECT emp_ID, city, start_date, sex FROM employee', aenc_conn)
aenctest

C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\1731557804.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  aenctest = pd.read_sql_query('SELECT emp_ID, city, start_date, sex FROM employee', aenc_conn)

   emp_ID        city               start_date sex
0     102     Needham  26-Feb-1987 12:00:00 AM   F
1     105     Waltham  02-Jul-1987 12:00:00 AM   M
2     129     Atlanta  04-Aug-1998 12:00:00 AM   M
3     148  Winchester  04-Oct-1997 12:00:00 AM   F
4     160      Milton  16-Dec-1987 12:00:00 AM   M
..    ...         ...                      ...  ..
70   1643  Burlington  15-Jun-1997 12:00:00 AM   F
71   1658     Waltham  28-Aug-1997 12:00:00 AM   M
72   1684     Waltham  13-Sep-1997 12:00:00 AM   F
73   1740     Bedford  23-Dec-1997 12:00:00 AM   M
74   1751     Needham  10-Jan-1998 12:00:00 AM   M

[75 rows x 4 columns]

AdventureWorks

In [22]:
awtest = pd.read_sql_query('SELECT businessEntityID, JobTitle, Gender, HireDate FROM HumanResources.Employee', adventureworks_conn)
awtest

C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\1320482586.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  awtest = pd.read_sql_query('SELECT businessEntityID, JobTitle, Gender, HireDate FROM HumanResources.Employee', adventureworks_conn)

     businessEntityID                       JobTitle Gender    HireDate
0                   1        Chief Executive Officer      M  2009-01-14
1                   2  Vice President of Engineering      F  2008-01-31
2                   3            Engineering Manager      M  2007-11-11
3                   4           Senior Tool Designer      M  2007-12-05
4                   5                Design Engineer      F  2008-01-06
..                ...                            ...    ...         ...
285               286           Sales Representative      F  2013-05-30
286               287         European Sales Manager      F  2012-04-16
287               288           Sales Representative      F  2013-05-30
288               289           Sales Representative      F  2012-05-30
289               290           Sales Representative      M  2012-05-30

[290 rows x 4 columns]

NorthWind

In [24]:
nwtest = pd.read_sql_query('SELECT EmployeeID, Title, HireDate, City, Region, Country FROM employees', northwind_conn)
nwtest

C:\Users\tinep\AppData\Local\Temp\ipykernel_14764\3796708429.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  nwtest = pd.read_sql_query('SELECT EmployeeID, Title, HireDate, City, Region, Country FROM employees', northwind_conn)

   EmployeeID                     Title   HireDate      City Region Country
0           1      Sales Representative 1992-05-01   Seattle     WA     USA
1           2     Vice President, Sales 1992-08-14    Tacoma     WA     USA
2           3      Sales Representative 1992-04-01  Kirkland     WA     USA
3           4      Sales Representative 1993-05-03   Redmond     WA     USA
4           5             Sales Manager 1993-10-17    London   None      UK
5           6      Sales Representative 1993-10-17    London   None      UK
6           7      Sales Representative 1994-01-02    London   None      UK
7           8  Inside Sales Coordinator 1994-03-05   Seattle     WA     USA
8           9      Sales Representative 1994-11-15    London   None      UK